[
  {
    "id": "theory_ga_2022_q1",
    "questionNumber": 1,
    "questionText": "Ha saji ni akɛshwie ohiɛ nɛɛ ateŋ ekome pɛ hetoo. Ohetoo lɛ falɛ ashɛ wiemɔkulibii 150.\n\na)\n\n \n\nŊmaa miishɛɛ adesa ko ni okane loo onu ni ata.\n\nb)\n\n \n\nGbaa sukuu ni oyaa amrɔ nɛɛ he sane otsɔɔ onaanyo ko ni yɔɔ maŋ kroko nɔ.\n\nc)\n\n \n\nNamɔ he yɔɔ sɛɛnamɔ ha bo, tsɔɔlɔ loo datrɛfonyo?\n\nd)\n\n \n\nŊmaa wolo oyaha onaanyo ko ni yɔɔ maŋsɛɛ ni otsɔɔ lɛ nitsumɔ ni obaasumɔ ni otsu wɔsɛɛ kɛ nɔ hewɔ.",
    "marks": 5,
    "subject": "Ga",
    "year": 2022,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_ga_2022_q2",
    "questionNumber": 2,
    "questionText": "Kanemɔ sane ni baa nɛɛ, ni oha sanebimɔi ni nyiɛ sɛɛ lɛ fɛɛ hetoo.\n\nGbi ko lɛ, Kpɛŋkpɛlɛ kɛ Akpokplonto gba kadaa yɛ amɛteŋ mɔ ni he yɔɔ oya he. Amɛkpɛlɛ nɔ akɛ amɛbaada foi yɛ he ko kɛtao tsitsitsɛ. Aje foidamɔ lɛ shishi nɔŋŋ ni Kpɛŋkpɛlɛ gbee hiɛ. Etsɛɛɛ ni eyɔse akɛ eshi Akpokplonto yɛ shɔŋŋ no hewɔ lɛ eyawo etsui fioo yɛ tso ko shishi ni wɔ vii ko nyɔ enɔ. Akpokplonto egbe foidamɔ lɛ naa ni eye kunim fɛɛ ni Kpɛŋkpɛlɛ miiwɔ lolo. Kpɛŋkpɛlɛ hɛle shi kɛjɛ wɔ lɛ mli ni ekɛ hiɛgbele he wo mli akɛ ekpe kpɔtɔɔ.\n\nKpɛŋkpɛlɛ tsɛ foidamɔ lɛ sɛɛ ekoŋŋ. Foidamɔ nɛɛ mli lɛ etsɛɛɛ ehe oleete dɔŋŋ, eje gbɛ ejo foi kɛ ehewale kɛ enyɛmɔ fɛɛ ni eye klɛŋklɛŋ gbɛhe. Gbɛ ni ka ekɛ Akpokplonto teŋ lɛ baafee shitoi abɔ.\n\nAkpokplonto shwie eyiŋ saŋŋ ni ena akɛ enyɛŋ eho Kpɛŋkpɛlɛ he kɔkɔɔkɔ yɛ foidamɔ mli kɛji akɛ amɛka he amɛda yɛ he ni amɛdaa yɛ daa nɛɛ. Kpɛŋkpɛlɛ bi ni amɛda foi lɛ ekoŋŋ yɛ he kroko. Faa efo foidamɔhe hee nɛɛ teŋ. Etsɛɛɛ ni Kpɛŋkpɛlɛ shɛ faa lɛ naa. Ehi jɛmɛ aahu kɛyashi Akpokplonto bashɛ shi ni esere efo faa lɛ ni eye kunim. Kpɛŋkpɛlɛ he yɛ nii akɛ hewalɛ yɛ enaji amli fe Akpokplonto nɔ lɛ shi Akpokplonto hu he yɛ nii yɛ gbɛ kroko nɔ.\n\nOtsi sɛɛ lɛ Kpɛŋkpɛlɛ kɛ Akpokplonto tsɔ gbɛ kome nɔ kɛtee yookpeemɔ. Akɛni amɛle he ni amɛhewalɛ kɛ amɛshigbeemɔ yɔɔ hewɔ lɛ amɛkplɛ nɔ akɛ amɛbaawa amɛhe yɛ gbɛ lɛ nɔ koni amɛyashɛ oya. Kpɛŋkpɛlɛ kpɛ Akpokplonto kɛjɛ gbɛfaa lɛ shishi kɛyata faa lɛ naa. Amɛtsake ni Akpokplonto hu kpɛ Kpɛŋkpɛlɛ kɛfo faa lɛ. No ni amɛkase akɛ kɛji mɛi pii fee ekome kɛtsu nii lɛ, ehi fe nɔ ni mɔ kometoo baatsu.\n\na)\n\n \n\nNamɔ ye kunim yɛ klɛŋklɛŋ foi ni ada lɛ mli?\n\nb)\n\n \n\nBɔ ni akɛ oleete tsu nii yɛ sane lɛ mli lɛ, mɛni ji eshishi?\n\nc)\n\n \n\nShii enyiɛ Kpɛŋkpɛlɛ kɛ Akpokplonto da foi kɛshi akaŋ lɛ?\n\nd)\n\n \n\nShii enyiɛ Kpɛŋkpɛlɛ kpe yɛ foidamɔ lɛ mli?\n\ne)\n\n \n\nMɛni Akpokplonto kɛfe Kpɛŋkpɛlɛ?\n\nf)\n\n \n\nMɛɛ srɔto yɔɔ foidamɔhei enyɔ lɛ ateŋ?\n\ng)\n\n \n\nOsusuɔ akɛ mɛni Kpɛŋkpɛlɛ kase kɛjɛ foidamɔ akaŋshii lɛ mli?\n\nh)\n\n \n\nMɛni ji wiemɔ Kpɛŋkpɛlɛ he yɛ nii akɛ hewalɛ yɛ anaji amli fe Akpokplonto nɔ lɛ shishi?\n\ni)\n\n \n\nMɛni nikasemɔ ona kɛjɛ sane nɛɛ mli?\n\nj)\n\n \n\nWo sane ni okane lɛ gbɛi. Gbɛi lɛ akafa fe wiemɔkulibii kpawo.",
    "marks": 5,
    "subject": "Ga",
    "year": 2022,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_ga_2022_q3",
    "questionNumber": 3,
    "questionText": "Ha saji ni abibii lɛ fɛɛ hetoo. Ŋmaa hetoo lɛ yɛ hetoohamɔ wolo lɛ nɔ.\n\nTsɔɔmɔ wiemɔ weku mli ni wiemɔ ni afo eshishi yɛ sanemuu fɛɛ sanemuu mli lɛ yɔɔ.\n\na)\n\n \n\nWɔ skul yɛ maŋ lɛ mli.\n\nb)\n\n \n\nEŋmɔ yɛ jɔɔ yoo lɛ mli.\n\nc)\n\n \n\nGbekɛbii lɛ na amtsɛ.\n\nd)\n\n \n\nKooloi lɛ na wɔ ni amɛjo foi.\n\ne)\n\n \n\nŊmɛnɛ lɛ mite shi mra.\n\nŊmaa gbɛiwiemɔ ni yɔɔ sanemuu fɛɛ sanemuu mli.\n\nf)\n\n \n\nWɔkpe sɛɛ kɛtee sukuu.\n\ng)\n\n \n\nYeifɔyei pii amli jɔ.\n\nh)\n\n \n\nEsha ni etsɔ lamlu.\n\ni)\n\n \n\nMaŋoi pii yɛ jɛmɛ.\n\nj)\n\n \n\nMinyɛ wɔ vii.\n\nFeemɔ sanemuji nɛɛ dabi.\n\nk)\n\n \n\nBa biɛ!\n\nl)\n\n \n\nEsa akɛ wɔna datrɛfonyo lɛ nɔŋŋ.\n\nm)\n\n \n\nAmɛgbe niyeli lɛ naa.\n\nn)\n\n \n\nWɔbaana naa kɛ.\n\no)\n\n \n\nMitsɛ ha mi shika.\n\nSaamɔ oŋmala sanemuji nɛɛ ni okɛ niŋmaa mli okadii awowoo hei ni sa akɛ amɛhiɔ.\n\np)\n\n \n\nMɛɛbe mana bo ekoŋŋ\n\nq)\n\n \n\nAmɛye amɛnu ni amɛjo.\n\nr)\n\n \n\nWɔle akɛ wɔbaŋ\n\ns)\n\n \n\nTee shi\n\nt)\n\n \n\nTsɔɔlɔ lɛ kɛɛ, mikplɛŋ nɔ kɔkɔɔkɔ.",
    "marks": 5,
    "subject": "Ga",
    "year": 2022,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_ga_2023_q1",
    "questionNumber": 1,
    "questionText": "Ha saji ni akɛshwie ohiɛ nɛɛ ateŋ ekome pɛ hetoo. Ohetoo lɛ falɛ ashɛ wiemɔkulibii 150.\n\na)\n\n \n\nMɛni Siniɔ Hai Sukuu (S.H.S) obaasumɔ ni oya kɛji ogbe Juniɔ Hai Sukuu (J.H.S) naa? Kɛ nibii ejwɛi atsɔɔ naa.\n\nb)\n\n \n\nAkɛ onukpa yɛ oklasi li, kɛ nibii ejwɛi atsɔɔ naa nɔ hewɔ ni esa akɛ oklasibii lɛ aba sukuu yɛ be ni sa mli.\n\nc)\n\n \n\nŊmaa wolo oyaha onaanyo ko yɛ suku kroko ni ogba lɛ sukuunyo ko ni osumɔɔ esane waa lɛ he sane. Kɛ nibii enyɔ atsɔɔ naa.\n\nd)\n\n \n\nŊmaa nibii ejwɛi kɛtsɔɔ naa akɛ mɔyii ni afo mli yɛ sukuu lɛ, okɛ mla wolɔi lɛ kpaa gbee aloo okɛ amɛkpaaa gbee.",
    "marks": 5,
    "subject": "Ga",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_ga_2023_q2",
    "questionNumber": 2,
    "questionText": "Kanemɔ sane ni baa nɛɛ, ni oha sanebimɔi ni nyiɛ sɛɛ lɛ fɛɛ hetoo.\n\nJeee nuu ko ni yɔɔ ŋamɛi enyɔ. Ekɛ eŋa nukpa lɛ hi shi afii enumɔ dani ekɛ mɔ ni ji enyɔ lɛ hi shi. Sɛɛkpee ŋa lɛ kene ni, shi onukpa lɛ yɛ bii etɛ.\n\nNuu lɛ hulɔ ni, eyɛ ŋmɔji wuji etɛ. Ekɛ enyɔ ha eŋamɛi lɛ koni amɛtsu mli nii. Mɔ ko mɔ ko tsuuu enaanyo nɔ mli nii fe akɛ enɔ pɛ. Yoo kene lɛ ŋmɔshi nibii shwere fe enienyɛ nɔ lɛ. Ena edɛŋ kpɔtɔɔ ni no ha ehiɛ kpa bi ni ebɛ lɛ nɔ. Ekɛ eshika lɛ eko heɔ atadei ewoɔ ebienyɛ bii lɛ.\n\nBei kplaŋŋ sɛɛ lɛ, hene nɛɛ yɔse akɛ ebienyɛ lɛ kɛ lɛ sharamɔ etsake kwraa. No hewɔ lɛ, ekpa nibii kpakpai ni efeɔ ni nomɛi haa ehiɛ baa nyam yɛ ebienyɛ lɛ hiɛ lɛ feemɔ.\n\nSane kome hu ji akɛ naakpɛɛ nɔ ko tee nɔ yɛ eŋmɔ lɛ mli. Kooloi komɛi bɔi eŋmɔshi nibii lɛ ahiɛ kpatamɔ. Egba nɔ ni yaa nɔ yɛ eŋmɔ lɛ mli lɛ etsɔɔ ewu.\n\nEwu lɛ shara shi kɛtee ŋmɔ lɛ mli eyakwɛ ehiŋmɛiŋ. Ena ofrote agbo ko ni miikpata ŋmɔshi nibii lɛ ahiɛ. Oya ni egbala etu lɛ, esusu lɛ ni etswa lɛ. Naakpɛɛ sane kome ji akɛ ofrote agbo lɛ tsake ehe etsɔ gbɔmɔ adesa ni je eŋa nukpa lɛ. Nuu lɛ jwɛŋmɔ shɛɛɛ nɔ ni ena lɛ he kwraa.\n\na)\n\n \n\nŊamɛi lɛ ateŋ namɔ ji kene?\n\nb)\n\n \n\nBii enyiɛ nuu lɛ yɔɔ?\n\nc)\n\n \n\nMɛni osusuɔ akɛ no hewɔ ni nuu lɛ kɛ eŋmɔji enyɔ lɛ ha eŋamɛi lɛ?\n\nd)\n\n \n\nMɛni ji wiemɔ shwere ni akɛtsu nii yɛ sane lɛ mli lɛ shishi?\n\ne)\n\n \n\nMɛni hewɔ ni kene lɛ kpa ebienyɛ bii lɛ wamɔ lɛ?\n\nf)\n\n \n\nMɛni yoo lɛ yɔse akɛ miiya nɔ yɛ eŋmɔ lɛ mli lɛ?\n\ng)\n\n \n\nMɛni hewɔ nuu lɛ tswa ofrote lɛ tu lɛ?\n\nh)\n\n \n\nMɛni naakpɛɛ nɔ ko ba yɛ tutswaa lɛ sɛɛ?\n\ni)\n\n \n\nMɛni nikasemɔ ona kɛjɛ adesa lɛ mli?\n\nj)\n\n \n\nWo sane ni okane nɛɛ gbɛi. Gbɛi lɛ akafa fe wiemɔkulibii kpawo.",
    "marks": 5,
    "subject": "Ga",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_ga_2023_q3",
    "questionNumber": 3,
    "questionText": "Ha saji ni abibii lɛ fɛɛ hetoo. Ŋmaa hetoo lɛ yɛ hetoohamɔ wolo lɛ nɔ. Kɛ tsamɔwiemɔ ni sa ahɔlɔ gbɛi ni ashishii yɛ saji ni baa nɛɛ mli li amli.\n\na)\n\n \n\nKwei ...... Awo baaba.\n\nb)\n\n \n\nKɛ jeee Tsotsoo lɛ ...... Mole baatere adeka lɛ.\n\nc)\n\n \n\nWɔna polisifonyo lɛ ...... wɔnako julɔ lɛ.\n\nd)\n\n \n\nMiyaŋ shia ...... mibɛ shika.\n\ne)\n\n \n\nHelatsɛ lɛ nyɛŋ enyiɛ ...... owo lɛ.\n\nŊmalamɔ nɔkwɛmɔnɔ kome kome oha wiemɔkui nɛɛ eko fɛɛ eko.\n\nf)\n\n \n\nKɔsoŋ gbɛi;\n\ng)\n\n \n\nGbɛi sisa;\n\nh)\n\n \n\nFeemɔwiemɔ;\n\ni)\n\n \n\nSutsɔɔlɔ;\n\nj)\n\n \n\nNajiaŋgbɛi.\n\nŊmalamɔ wiemɔ ni kɛ wiemɔi ni afolɔ amɛshi lɛ shiɔ koŋ.\n\nk)\n\n \n\nKaale ji gbekɛ yoo ni he yɛ fɛo.\n\nl)\n\n \n\nTsɔɔlɔ lɛ kadi nitsumɔ lɛ oyayai.\n\nm)\n\n \n\nNikaselɔ nukpa lɛ hiɛ kashi jogbaŋŋ.\n\nn)\n\n \n\nHei! Aku ta shi yɛ biɛ.\n\no)\n\n \n\nAbossey wo atade kakadaŋŋ ko.\n\nŊmalamɔ sutsɔɔlɔ srɔtoi ni yɔɔ saji ni baa nɛɛ mli.\n\np)\n\n \n\nMaŋtsɛ lɛ he okpɔŋɔ yɛŋ.\n\nq)\n\n \n\nYoo ni fi duku wuɔfɔ su lɛ minyɛ ni.\n\nr)\n\n \n\nWɔtsɔɔlɔ lɛ ji nuu ni hiɛ kashi lɛ.\n\ns)\n\n \n\nNuu kpitioo lɛ ji lɔyafonyo.\n\nt)\n\n \n\nMaŋoi ni etsutsui bɛ tso lɛ nɔ.",
    "marks": 5,
    "subject": "Ga",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  }
]