[
  {
    "id": "theory_creative_arts_2024_q1",
    "questionNumber": 1,
    "questionText": "(a)\n\n \n\nUsing crayon or colour pencil, draw a cone in the space provided and render it solid using the mass shading technique\n\n(b)\n\n \n\nIn the spaces provided below, draw any two different objects that are conical in shape.\n\nUse the stippling technique to shade the drawn object in Box 'A' and hatching technique to shade the other in Box 'B'.\n\nBOX A\n\nBOX B",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q2",
    "questionNumber": 2,
    "questionText": "A Creative Art and Design teacher assigned the class to produce artworks intended to educate learners on keeping the school compound and the classrooms neat.\n\nAs a Creative Art and Design learner:\n\n(a)\n\n \n\nGive two artworks that you would produce to solve the problem.\n\n(b)\n\n \n\nState the appropriate technique that you would use to produce each artwork in (a) above.\n\n(c)\n\n \n\nIn an orderly manner, state that first four design processes that you would use in designing the artworks.\n\n(d)\n\n \n\nBalance is one of the key principles of design that could be used in the production of the artworks in (a). Identify any two types of balance and explain only one of them.\n\n(e)\n\n \n\nEnumerate two precautions that should be observed during the production of the artworks in (a) above.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q3",
    "questionNumber": 3,
    "questionText": "(a)\n\n \n\nYour school intends to organize an exhibition during the upcoming 20th Anniversary Celebration.\n\nAs the leader of the organizing team, explain three factors that will guide a successful planning and organizing of the exhibition.\n\n(i)\n\n \n\n(ii)\n\n \n\n(iii)\n\n \n\n(b)\n\n \n\nImagine yourself in a Creative Art and Design class, and you are to assemble pieces of materials into artworks for the exhibition.\n\nIdentify two essential tools you would use for each of the listed activities below:\n\n(i)\n\n \n\nCutting of wires and papers;\n\n(ii)\n\n \n\nMaking holes in metals and plastics;\n\n(iii)\n\n \n\nJoining of lead and copper.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q4",
    "questionNumber": 4,
    "questionText": "(a)\n\n \n\nOn the music manuscript provided, notate the following letters on the Treble Staff using minims or half notes:\n\n(i)\n\n \n\nECG;\n\n(ii)\n\n \n\nBAD;\n\n(iii)\n\n \n\nAGF.\n\n(b)\n\n \n\nPlace the underlisted instruments under their respective classification in the table below:\n\n(i)\n\n \n\nDonno;\n\n(ii)\n\n \n\nSeperewa;\n\n(iii)\n\n \n\nMbira;\n\n(iv)\n\n \n\nAtenteben;\n\n(v)\n\n \n\nMmensuon.\n\nCHORDOPHONE\n\nIDEOPHONE\n\nMEMBRANOPHONE\n\nAEROPHONE\n\n\n\n\n\n\n\n\n\n(c)\n\n \n\nIn a particular song, bar 1 has four quavers, bar 2 has one minim and bar 3 has two crotchets.\n\nIdentify the time signature for the song.\n\n(d)\n\n \n\nExplain why the song Yɛn ara asaase ni is in a binary form.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q5",
    "questionNumber": 5,
    "questionText": "(a)\n\n \n\nUsing the tonic solfa notation, write the members of the following:\n\n(i)\n\n \n\nChord I;\n\n(ii)\n\n \n\nChord IV;\n\n(iii)\n\n \n\nChord V.\n\n(b)\n\n \n\nAt a choral music concert in your school, you would enjoy the words and the harmonious voices as the performance unfolds.\n\nIdentify and describe any three voice parts that you would find delightful during the performance.\n\n(c)\n\n \n\nWrite short notes on any one of the following composers; focusing on his hometown, genre of words, one example of his works and contribution made to society.\n\n(i)\n\n \n\nEphraim Amu;\n\n(ii)\n\n \n\nAgya Koo Nimo;\n\n(iii)\n\n \n\nBlack Sherif.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q6",
    "questionNumber": 6,
    "questionText": "(a)\n\n \n\nAdzo and Komla are about to perform the Bɔbɔɔbɔ dance.\n\nList three costume items they would use.\n\n(b)\n\n \n\nIn the performance of African music and dance, the stage is well used by all performers so that the audience can enjoy the performance.\n\nDescribe how drummers, singers and dancers are arranged on a stage during the performance of \"Kpanlogo\".\n\n(c)\n\n \n\nWrite short notes on any one of the following performing art personalities; focusing on the profession, contribution to society and an example of any of their works:\n\n(i)\n\n \n\nMartin Owusu;\n\n(ii)\n\n \n\nFrancis Nii Yartey;\n\n(iii)\n\n \n\nAma Atta Aidoo.\n\n(d)\n\n \n\nAt a festival in your hometown, you observed colourfully dressed and energetic dancers perform various traditional dances. Reflecting on the performances, you came to a realization that dance drama plays a significant role in the Ghanaian culture.\n\nState three of such roles that came to mind during the reflection.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2024_q7",
    "questionNumber": 7,
    "questionText": "(a)\n\n \n\nIn the table below, group the listed traditional dances under the following ethnic groups.\n\nDANCES: Bamaya, Gahu, Gota, Kete, Nagla and Takai.\n\nEWE\n\nAKAN\n\nMOLE-DAGBANI\n\n\n\n\n\n\n\n(b)\n\n \n\nDescribe each of the following type of dance movements:\n\n(i)\n\n \n\nAlignment;\n\n(ii)\n\n \n\nBalance.\n\n(c)\n\n \n\nSome years ago, storytelling was a form of entertainment for most Ghanaian traditional societies. However, in today's digital age, the television and internet are filled with a lot of soap operas, which may not be suitable for children.\n\nState two reasons why story telling should still be encouraged in the Ghanaian culture.",
    "marks": 5,
    "subject": "Creative Arts",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2025_q1",
    "questionNumber": 1,
    "questionText": "hour 15 minutes\n\nPaper 2 is in three sections: A, B and C. Answer four questions only: Two questions in section A using the spaces provided in the question paper: One question each from section B and C to be answered in the answer booklet provided.\n\nSECTION A\n\nVISUAL ART\n\n[30 marks]\n\nAnswer two questions only from this section, question 1 and any other.",
    "marks": 30,
    "subject": "Creative Arts",
    "year": 2025,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2025_q1",
    "questionNumber": 1,
    "questionText": "(a)\n\n \n\nIn the space provided, draw the six point colour wheel.\n\n(i)\n\n \n\nUse the hatching technique to shade the secondary colours.\n\n(ii)\n\n \n\nUse the stippling technique to shade the primary colours.\n\n[12 marks]\n\n(b)\n\n \n\nList cool colours found on the colour wheel drawn in (a).\n\n[3 marks]",
    "marks": 12,
    "subject": "Creative Arts",
    "year": 2025,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2025_q2",
    "questionNumber": 2,
    "questionText": "(a)\n\n \n\nThe Black star party has 85,000 members. The party intends to embark on rally in December, 2025. They have therefore decided to print a new cloth for the rally.\n\nAs a student artist:\n\n(i)\n\n \n\nidentify the most appropriate method to be used for printing the cloth for the members;\n\n[2 marks]\n\n(ii)\n\n \n\nstate two reasons for the choice of printing method identified in (i) above.\n\n[4 marks]\n\n(iii)\n\n \n\nList three wet media that would be useful for the printing of the cloth.\n\n[3 marks]\n\n(b)\n\n \n\nYour teacher tasked the class to weave a stole to be used by the final year leavers for their 10th graduation celebration.\n\nAs a creative student:\n\n(i)\n\n \n\nenumerate the two sets of yarns that would be used for the stole;\n\n[2 marks]\n\n(ii)\n\n \n\ndescribe any one of the yarns enumerated in (i) above;\n\n[2 marks]\n\n(iii)\n\n \n\nList any two tools that would help in weaving the stole.\n\n[2 marks]",
    "marks": 2,
    "subject": "Creative Arts",
    "year": 2025,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_creative_arts_2025_q3",
    "questionNumber": 3,
    "questionText": "(a)\n\n \n\nAku has been tasked to produce a vase with clay for the upcoming interschool art competition.\n\n(i)\n\n \n\nList two tests that can be done on the clay for its suitability.\n\n[2 marks]\n\n(ii)\n\n \n\nDescribe in three steps how to prepare the clay for the task.\n\n[3 marks]\n\n(iii)\n\n \n\nIdentify one technique that can be used to decorate the vase.\n\n[1 mark]\n\n(b)\n\n \n\nThe creative arts learners displayed their works for appreciation. As part of the class, explain three benefits that you will derive from this activity.\n\n(i)\n\n \n\n(ii)\n\n \n\n(iii)\n\n \n\n[9 marks]",
    "marks": 2,
    "subject": "Creative Arts",
    "year": 2025,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  }
]