[
  {
    "id": "theory_asante_twi_2023_q1",
    "questionNumber": 1,
    "questionText": "(a)\n\n \n\nKyerɛ sɛnti nnan a wobɛpɛ sɛ wokɔ Ntoasoɔ Sɔkuu (SHS) pɔtee bi berɛ a woawie Junior High School.\n\n(b)\n\n \n\nWoyɛ wo gyinapɛn sofoɔ panin. Kyerɛ sɛnti nnan a ɛsɛ sɛ wo mfɛfoɔ no ba sukuu ntɛm.\n\n(c)\n\n \n\nTwerɛ lɛtɛ kuma w'adamfo a ɔwɔ sukuu foforɔ mu na kyerɛ no w'adamfo a wopɛ n'asɛm pa ara ho asɛm. Kyerɛ sɛnti mmienu a wopɛ n'asɛm.\n\n(d)\n\n \n\nKyerɛ sɛnti nnan a wopene anaa wompene mmaatwa so wɔ Mfitiaseɛ Sukuu mu.\n\n  \n\nPART IICOMPREHENSION(10 Marks)\n\nKenkan deɛ ɛdidi soɔ yi na bua nsɛmmisa no nyinaa.",
    "marks": 10,
    "subject": "Asante Twi",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2023_q2",
    "questionNumber": 2,
    "questionText": "Ɔpanin bi tenaa ase a na ɔwɔ yerenom baanu. Ɔwaree ne yere panin no, mfeɛ num akyi na ɔwaree kumaa no nso. Na ne yere kumaa no yɛ obonini. Ne yere panin no deɛ na ɔyɛ ɔwofoɔ a ɔwɔmma baasa.\n\nNa ɔpanin yi a ɔyɛ okuani no wɔ mfuo akɛseɛ mmiɛnsa. Ɔde mfuo no mu mmienu maa ne yerenom no sɛ wɔnyɛ mu nnwuma mfa. Obiara yeree ne ho yɛɛ ne deɛmu adwuma. Sɛ wode mfuo mmienu no toto ho a,kumaa no deɛ yɛɛ frɔmfrɔm senee ɔpanin no yei maa kumaa no bɛyɛɛ osikani maa ne werɛ firii awerɛhoɔ a na ɔdi wɔ awoɔ a na ɔnwo no ho. Na ɔtaa de ne sika totɔ ntadeɛ ma ne kora mma no.\n\nƐduruu mmerɛ bi no, ɔyere kumaa no hunuu sɛ nsakyeraeɛ aba ne kora no nneyɛɛ mu. Ne saa nti, ɔyere kumaa no yɛɛ n'adwene sɛ ɔnyɛ ade pa biara a ɛbɛsɔ ne kora no ani bio.\n\nƐbaa saa no, anwanwadeɛ bi sii ɔyere kumaa no afuom hɔ. Mmoa bi hyɛɛ aseɛ sɛee n'afuo no maa no kɔbɔɔ ne kunu amanneɛ.\n\nYei maa ne kunu no kɔɔ afuom hɔ hɔhwɛɛ deɛ asie no. Ɔhunuu Ɔnwansane kɛseɛ bi sɛ ɔresɛe afuo no, ɔgyenee n'ani hwɛɛ Ɔnwansane kɛseɛ no too ne tuo. Aboa no danee nipa a na ɔsɛ ne yere panin no. Ɔpanin no ho dwirii no yie.\n\n(a)\n\n \n\nƆpanin no yere mu hwan na ɔyɛ obonini?\n\n(b)\n\n \n\nNa ɔpanin no mma yɛ sɛn?\n\n(c)\n\n \n\nWogye di sɛ deɛn nti na ɔpanin no de mfuo no mu mmienu maa ne yerenom no?\n\n(d)\n\n \n\nKyerɛ saa asɛm yi ase sɛdeɛ ɛteɛ wɔ ayɛsɛm no mu: frɔmfrɔm.\n\n(e)\n\n \n\nAdɛn nti na ɔyere kumaa no yɛɛ n'adwene sɛ ɔmmoa ne kora mma no bio?\n\n(f)\n\n \n\nAnwanwadeɛ sononko bɛn na ɔyere kumaa no hunuu wɔ n'afuo no mu?\n\n(g)\n\n \n\nAdɛn nti na ne kunu no too ɔnwansane kɛseɛ no tuo?\n\n(h)\n\n \n\nƆpanin no too ɔnwansane kɛseɛ no tuo no, anwanwadeɛ bɛn na esiiɛ?\n\n(i)\n\n \n\nAdesuadeɛ bɛn na wosua firii ayɛsɛm no mu?\n\n(j)\n\n \n\nFa nsɛmfua a ɛmmoro nson to ayɛsɛm no din.\n\n  \n\nPART IIILEXIS AND STRUCTURE(20 Marks)",
    "marks": 20,
    "subject": "Asante Twi",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2023_q3",
    "questionNumber": 3,
    "questionText": "Yiyi nsɛmmisa a ɛwɔ ɔfa ha yi nyinaa ano.\n\nFa nkabomdeɛ a ɛfata hyɛ baabi a wɔagya wɔ ɔkasamu no mu\n\n(a)\n\n \n\nAdam ...... Abu bɛba.\n\n(b)\n\n \n\nEbia Simli ...... Aisha na ɔbɛsoa adaka no.\n\n(c)\n\n \n\nYɛahunu polisini no ...... yɛnhunuu ɔkorɔmfoɔ no.\n\n(d)\n\n \n\nMerenkɔ fie ...... menni sika.\n\n(e)\n\n \n\nYarefoɔ no ntumi nnante ...... wofa no.\n\nTwerɛ nsɛmfuakuo a ɛdidi soɔ yi mu biara ho nhwɛsoɔ baako\n\n(f)\n\n \n\nDin pa;\n\n(g)\n\n \n\nEdin a yɛnhunu;\n\n(h)\n\n \n\nAdeyɔ\n\n(i)\n\n \n\nEdin nkyerɛkyerɛmu;\n\n(j)\n\n \n\nEdinnsiananmu.\n\nTwerɛ nsɛmfua a wɔatwitwa aseɛ wɔ ɔkasamu a ɛdidi soɔ yi mu biara abirahɔ\n\n(k)\n\n \n\nKande yɛ abaayewa a ne ho yɛ fɛ\n\n(l)\n\n \n\nƆkyerɛkyerɛfoɔ no twaa asuafoɔ no dwumadie no ntɛmntɛm\n\n(m)\n\n \n\nAsuafoɔ no so panin no nim adeɛ pa ara.\n\n(n)\n\n \n\nHei Akua! Tena ha.\n\n(o)\n\n \n\nHalim hyɛ atadeɛ tenten.\n\nTwerɛ edin nkyerɛkyerɛmu a ɛwɔ ɔkasamu a ɛdidi soɔ yi biara mu\n\n(p)\n\n \n\nƆhene no tɔɔ pɔnkɔ fitaa.\n\n(q)\n\n \n\nƆbaa a ɔbɔ duku akokɔsradeɛ no yɛ me maame.\n\n(r)\n\n \n\nYɛn kyerɛkyerɛni yɛ ɔbarima nyansafoɔ.\n\n(s)\n\n \n\nPapa tiatia no yɛ lɔyani.\n\n(t)\n\n \n\nAmango a abere biara nni dua no so.",
    "marks": 5,
    "subject": "Asante Twi",
    "year": 2023,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2024_q1",
    "questionNumber": 1,
    "questionText": "(a)\n\n \n\nWo papa pɛ sɛ woyɛ lɔyani anaa tikyani. Twerɛ lɛtɛ kɔma no, na kyerɛ sɛnti ɛnam na wopɛ sɛ woyɛ mu baako.\n\n(b)\n\n \n\nKyerɛkyerɛ nnoɔma ahodoɔ mmienu a ɛde lɔre akwanhyia ba mu, na kyerɛ akwan ahodoɔ mmienu a yɛbɛfa so asi ano.\n\n(c)\n\n \n\nKa onipa bi a wopɛ n'asɛm pa ara wɔ wo kurom ho asɛm, na kyerɛ deɛ nti a wopɛ n'asɛm.\n\n(d)\n\n \n\nTwerɛ abasɛm bi a n'awieeɛ ne sɛ, \" ... na ɔnuu ne ho wɔ deɛ ɔyɛeɛ no ho\".\n\n \n\nPART IICOMPREHENSION[10 marks]\n\nKenkan deɛ ɛdidi soɔ yi na bua nsɛmmisa no nyinaa.",
    "marks": 10,
    "subject": "Asante Twi",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2024_q2",
    "questionNumber": 2,
    "questionText": "Mfeɛ pii nie na nsaase akɔ ahohiahia mu pa ara. Nkurɔfoɔ kɔ so ara sɛe nneɛma a ɛboa ma asetena kɔ so no. Ɔdomankoma asaase a ɔde ama yɛn no, saa nkurɔfoɔ no kɔ so di no nya.\n\nEmu deɛ ereha adwene pa ara Ghana ha nnɛ yi ne \"galamsey\". Saa ɔkwan a wɔfa so tu fam agudeɛ yi asɛe asaase ma adane ɛserɛ. Sɛ wohwɛ ɔkwan a wɔn a wɔnni tumi krataa biara no fa so tu fam agudeɛ no si funtum asaase no a, ɛyɛ awerɛho yie. Yɛn kwaeɛ nyinaa asɛe koraa. Abɔfoɔ ne abɛtwafoɔ nam wɔn dwumadie so ama yɛn kwaeɛ no mu ɛfa kɛseɛ no ara ahye dwerɛbee.\n\nYɛn nsubɔntene, nsuwansuwa ne atadeɛ mpo nyina ho akeka. Na mpo, nnipa nam wɔn nneyɛɛ ahodoɔ so asɛe ɛpo kɛseɛ no. Yei ama ayɛ hu ama nnipa a wɔtete ho ne abɔdeɛ a wɔwɔ mu no nyinaa. Saa adeɛ yi reyɛ agye nsam. Ɛsɛ sɛ wɔyɛ biribi de si ano seesei ara. Ɛsɛ sɛ mpanimfoɔ sɔre waka yɛ biribi de si saa ɔhaw no ano.\n\n(a)\n\n \n\nƐdeɛn na nkurɔfoɔ resɛe no no?\n\n(b)\n\n \n\nƐdeɛn na yɛnya firi Ɔdomankoma asaase a ɔde ama yɛn no mu?\n\n(c)\n\n \n\nAdɛn nti na galamsey ne adeɛ a ɛreha yɛn?\n\n(d)\n\n \n\nDwuma bɛn na abɔfoɔ ne abɛtwafoɔ di de ma yɛn kwaeɛ hye dwerɛbee?\n\n(e)\n\n \n\nKyerɛ saa nsɛm yi ase sɛdeɛ wɔde di dwuma wɔ akenkansɛm no mu:\n\n(i)\n\n \n\ndi no nya;\n\n(ii)\n\n \n\nfuntum.\n\n(f)\n\n \n\nKyerɛ dwuma baako a nnipa nam so sɛe ɛpo.\n\n(g)\n\n \n\nAdɛn nti na abɔdeɛ ahodoɔ a wɔwɔ ɛpo mu no nni ahotɔ?\n\n(h)\n\n \n\nAdɛn na ɔtwerɛfoɔ na ka sɛ, ɛreyɛ agye nsam?\n\n(i)\n\n \n\nKyerɛ saa asɛm yi ase sɛdeɛ ɛteɛ wɔ akenkansɛm no mu: sɔre waka.\n\n(j)\n\n \n\nAdesuadeɛ bɛn na woanya afiri akenkansɛm no mu?\n\n \n\nPART IIITRANSLATION[10 marks]",
    "marks": 10,
    "subject": "Asante Twi",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2024_q3",
    "questionNumber": 3,
    "questionText": "Kyerɛ deɛ ɛdidi soɔ yi ase kɔ Asante Twi mu.\n\n(a)\n\n \n\nShe likes washing her clothes on Fridays.\n\n(b)\n\n \n\nMartha came here but did not meet you.\n\n(c)\n\n \n\nWhy is Abiba not coming to eat with us?\n\n(d)\n\n \n\nWe do not like her but we have to contain her.\n\n(e)\n\n \n\nAma cooked the food and Kojo washed the bowls.\n\n(f)\n\n \n\nOur teacher shouted, \"shut up, all of you!\"\n\n(g)\n\n \n\nWhy is Kofi unhappy these days?\n\n(h)\n\n \n\nThe game was lost through carelessness.\n\n(i)\n\n \n\nWe do not want to fail the examination.\n\n(j)\n\n \n\nTell him to see me at once.\n\n  \n\nPART IVLANGUAGE AND USAGE[10 marks]",
    "marks": 10,
    "subject": "Asante Twi",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  },
  {
    "id": "theory_asante_twi_2024_q4",
    "questionNumber": 4,
    "questionText": "Yiyi nsɛmmisa a ɛwɔ ɔfa ha nyinaa ano.\n\nNsɛmmisa (a) - (g) mu no, kyerɛ asɛmfuakuo a nsɛmfua a wɔasan aseɛ no firi mu.\n\n(a)\n\n \n\nMansa maa no sika.\n\n(b)\n\n \n\nYɛbɛyɛ adwuma no abom.\n\n(c)\n\n \n\nNanabarima annye me frɛ no so.\n\n(d)\n\n \n\nWɔkyeree ɔbaa daadaafoɔ no nnɛ.\n\n(e)\n\n \n\nYɛn awofoɔ bɛduruu dwoodwoo nnora.\n\n(f)\n\n \n\nM'awofoɔ maa me tɛlɛvihyen.\n\n(g)\n\n \n\nƆbɛware wɔ yɛn akuraa hɔ saa bosome yi.\n\nNsɛmmisa (h) - (j) mu no, fa atwerɛ mu agyinahyɛdeɛ a ɛfata wie ɔkasamu biara.\n\n(h)\n\n \n\nBerɛ bɛn na Abankwa firii fie\n\n(i)\n\n \n\nYɛtɔɔ amango aprɛ ne ankaa.\n\n(j)\n\n \n\nMo nyinaa nyɛ komm",
    "marks": 5,
    "subject": "Asante Twi",
    "year": 2024,
    "examType": "BECE",
    "type": "theory",
    "difficulty": "medium",
    "topics": []
  }
]